---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FbxLightEmitRectangleWidth
source: html/e9f52a5c-c58c-dc53-104d-413d4149f4a3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FbxLightEmitRectangleWidth Property

"Emit from Rectangle Width"

## Syntax (C#)
```csharp
public static ForgeTypeId FbxLightEmitRectangleWidth { get; }
```